use crate::faker::automotive::raw::LicencePlate;
use crate::{faker::impls::address::CityNameGenFn, locales::Data, Dummy};
use rand::prelude::IndexedRandom;

#[allow(non_camel_case_types)]
#[derive(Copy, Clone)]
pub struct FA_IR;

impl Data for FA_IR {
    const NAME_FIRST_NAME: &'static [&'static str] = &[
        // آ
        "آدینه",
        "آناهیتا",
        "آراد",
        "آرزو",
        "آرسام",
        "آریا",
        "آروین",
        "آوا",
        "آیدا",
        // الف
        "افشین",
        "افسانه",
        "افسون",
        "افرا",
        "امیر",
        // ب
        "بهاره",
        "بهنوش",
        "بهمن",
        "باران",
        "بهرام",
        "بردیا",
        "بیتا",
        "بیژن",
        // پ
        "پریا",
        "پرینسا",
        "پروا",
        "پرستش",
        "پژمان",
        "پرهام",
        "پارسا",
        "پانیذ",
        "پوریا",
        "پدرام",
        // ت
        "توفیق",
        "ترانه",
        // ث
        "ثریا",
        // ج
        "جمیله",
        "جیران",
        // چ
        "چنارا",
        "چکاوک",
        // ح
        "حامد",
        "حمید",
        "حسین",
        "حافظ",
        "حسام",
        // خ
        "خداداد",
        "خشایار",
        // د
        "دارا",
        "دیاکو",
        "دلسا",
        "دلارام",
        // ذ
        "ذبیح",
        "ذلفا",
        // ر
        "رادین",
        "رادمهر",
        "رها",
        "رستا",
        "راستین",
        "رستم",
        "روزبه",
        // ز
        "زهره",
        "زهرا",
        // ژ
        "ژیونس",
        "ژاله",
        "ژینا",
        "ژاکلین",
        // س
        "ساناز",
        "ساحل",
        "سورنا",
        "سامیار",
        "ستایش",
        "سیمین",
        "سینا",
        "سهیل",
        "سهند",
        "سهراب",
        "سوگند",
        // ش
        "شادی",
        "شهرزاد",
        "شبنم",
        "شیدا",
        "شیوا",
        "شیلا",
        "شیما",
        "شقایق",
        "شهین",
        "شهلا",
        // ص
        "صبا",
        // ض
        "ضیا",
        // ط
        "طاها",
        "طوفان",
        "طناز",
        "طلا",
        // ظ
        "ظریفه",
        "ظفر",
        // ع
        "عارف",
        "عطا",
        "عرفان",
        // غ
        "غزال",
        "غدیر",
        "غزل",
        // ف
        "فرشاد",
        "فرح",
        "فرهاد",
        "فرامرز",
        "فریبرز",
        "فرشید",
        "فربد",
        "فیروزه",
        // ق
        "قمر",
        "قباد",
        // ک
        "کیمیا",
        "کیومرث",
        "کامران",
        // گ
        "گیسو",
        "گلبهار",
        "گوهر",
        "گشتاسب",
        "گیتی",
        // ل
        "لیلا",
        "لعیا",
        "لادن",
        "لیدا",
        // م
        "ماهان",
        "مژگان",
        "میلاد",
        "مینو",
        "مونا",
        "مهراد",
        "مهران",
        "مهرسا",
        "مهسا",
        "مهیار",
        "مهدیس",
        "مریم",
        // ن
        "ناهید",
        "نرگس",
        "نفس",
        "نیکا",
        "نیکان",
        "نیکو",
        "نیما",
        "نوید",
        // و
        "وارسا",
        "والا",
        "ویهان",
        // ه
        "همتا",
        "همدم",
        // ی
        "یاس",
        "یاسمین",
        "یگانه",
        "یلدا",
    ];

    const NAME_LAST_NAME: &'static [&'static str] = &[
        // آ
        "آژدیده",
        "آقاجری",
        "آژند",
        "آهنگر",
        "آریا",
        "آشنا",
        "آریان‌پور",
        "آدینه",
        // الف
        "ابطحی",
        "ادب",
        "ادیبی",
        "ارسباران",
        "اشتری",
        "اشراقی",
        "اصلانی",
        "انتظامی",
        // ب
        "باهنر",
        "بزرگی",
        "بزرگیان",
        "برزویی",
        "برزگر",
        "بختیار",
        "بهشتی",
        "بیگی",
        // پ
        "پناهنده",
        "پناهی",
        "پناهیان",
        "پورنگ",
        "پورناظری",
        "پیران",
        "پارسا",
        "پیوندی",
        "پویان",
        "پویان‌فر",
        "پازوکی",
        // ت
        "ترکاشوند",
        "توسلی",
        "تهرانی",
        "توکلیان",
        // ث
        "ثریا",
        "ثابتی",
        // ج
        "جهانگیری",
        "جهانی",
        "جنتی",
        "جعفریان",
        // چ
        "چاوشی",
        "چکاوکی",
        "چنگیزی",
        "چگنی",
        // ح
        "حسابی",
        "حقیقی",
        "حسینی",
        "حیاتی",
        "حقانی",
        // خ
        "خاموشی",
        "خامنه‌ای",
        "خدایی",
        "خداپناهی",
        "خرم‌آبادی",
        "خسروپناه",
        "خمسه",
        "خیابانی",
        // د
        "دیباج",
        "دهقان",
        "دستغیب",
        "درگاهی",
        "دانایی‌فرد",
        "داور",
        // ذ
        "ذاکر",
        // ر
        "راسخ",
        "راوندی",
        "رحماندوست",
        "رستمی",
        "رنجبر",
        "رفیعی",
        "روزبه",
        "رهنما",
        // ز
        "زنوزی",
        "زین‌الدین",
        "زرشناس",
        "زالی",
        "زارع",
        // ژ
        "ژرف‌اندیش",
        "ژاله",
        // س
        "سادات",
        "ساعی",
        "ساعدی",
        "سحاب",
        "ستاری",
        "سراج",
        "سرمدی",
        "سپه‌وند",
        "سهند",
        "سلامت",
        "سروش",
        // ش
        "شرع‌پسند",
        "شجاعی",
        "شاملو",
        "شادمهر",
        "شیوا",
        "شباهنگ",
        "شریعتمداری",
        "شریعتی",
        "شاه‌حسینی",
        "شرف",
        // ص
        "صباغ",
        "صدر",
        "صدیق",
        "صفوی",
        // ض
        "ضیا",
        "ضابطی",
        "ضرغامی",
        // ط
        "طاها",
        "طباطبائی",
        "طبیب‌زاده",
        "طریقت",
        // ظ
        "ظریف",
        "ظفرقندی",
        // ع
        "عارف",
        "عطایی",
        "عاشوری",
        "عبدلی",
        "عراقی",
        "عزیزی",
        "عصار",
        "علیا",
        "عنایت",
        // غ
        "غزال",
        "غدیر",
        "غزل",
        // ف
        "فنایی",
        "فریاد",
        "فروتن",
        "فرامرز",
        "فهمیده",
        "فولادوند",
        "فرهنگ",
        "فارسی",
        // ق
        "قاضی",
        "قبادی",
        "قمیشی",
        "قهرمانی",
        "قهستانی",
        "قبادلو",
        // ک
        "کاشی",
        "کامکار",
        "کامران",
        "کاویانی",
        "کاکاوند",
        "کدیور",
        // گ
        "گلپایگانی",
        "گنجی",
        "گنجور",
        "گرشسابی",
        "گرجی",
        // ل
        "لاجوردی",
        "لاهوتی",
        "لاچینی",
        "لنکرانی",
        // م
        "مجرد",
        "مهدوی",
        "مرادبیگی",
        "محدثی",
        "محدث",
        "مرادخانی",
        "مهرآیین",
        "مددی",
        "محمدی",
        "مشا",
        "مظفر",
        "معارف‌وند",
        // ن
        "نامور",
        "نامداری",
        "نامنی",
        "ناجی",
        "نواب",
        "نیکوصفت",
        "نوبخت",
        "نقی‌لو",
        // و
        "واعظ",
        "وکیلی",
        "واثقی",
        "واعظی",
        // ه
        "هامون",
        "هدایت",
        "همت",
        "هومن",
        // ی
        "یاحقی",
        "یثربی",
        "یگانه",
        "یاوری",
    ];

    const INTERNET_FREE_EMAIL_PROVIDER: &'static [&'static str] = &[
        "mailma.ir",
        "gmail.com",
        "hotmail.com",
        "icloud.com",
        "mailfa.com",
        "live.com",
        "outlook.com",
        "hod.ir",
        "yahoo.com",
    ];
    const INTERNET_DOMAIN_SUFFIX: &'static [&'static str] = &["ir", "com", "net", "org"];

    const PHONE_NUMBER_FORMATS: &'static [&'static str] = &["+98 21 ########", "+98 ## ########"];
    const PHONE_CELL_NUMBER_FORMATS: &'static [&'static str] =
        &["+98 91# #######", "+98 93# #######", "+98 92# #######"];

    const CHRONO_DEFAULT_TIME_FORMAT: &'static str = "%H:%M:%S";
    const CHRONO_DEFAULT_DATE_FORMAT: &'static str = "%Y/%m/%d";
    const CHRONO_DEFAULT_DATETIME_FORMAT: &'static str = "%Y/%m/%d %H:%M:%S";

    const TIME_DEFAULT_DATE_FORMAT: &'static str = "[year]/[month]/[day]";
    const TIME_DEFAULT_DATETIME_FORMAT: &'static str =
        "[year]/[month]/[day] [hour]:[minute]:[second]";

    const ADDRESS_BUILDING_NUMBER_FORMATS: &'static [&'static str] = &["nº ###", "nº ##", "nº #"];
    const ADDRESS_CITY_PREFIX: &'static [&'static str] = &["Villa", "San", "Santa", "Santo"];
    const ADDRESS_CITY_SUFFIX: &'static [&'static str] =
        &["del Castello", "del Lago", "del Tramonto"];
    const ADDRESS_COUNTRY: &'static [&'static str] = &[
        "افغانستان",
        "آلبانی",
        "الجزایر",
        "آندورا",
        "آنگولا",
        "آنگویلا",
        "آنتارکتیک",
        "آنتیگوا و باربودا",
        "عربستان سعودی",
        "آرژانتین",
        "ارمنستان",
        "آروبا",
        "استرالیا",
        "اتریش",
        "آذربایجان",
        "باهاما",
        "بحرین",
        "بنگلادش",
        "باربادوس",
        "بلژیک",
        "بلیز",
        "بنین",
        "برمودا",
        "بوتان",
        "بلاروس",
        "میانمار",
        "بولیوی",
        "بوسنی و هرزگوین",
        "بوتسوانا",
        "برزیل",
        "برونئی",
        "بلغارستان",
        "بورکینافاسو",
        "بوروندی",
        "کامبوج",
        "کامرون",
        "کانادا",
        "کیپ‌ورد",
        "چاد",
        "شیلی",
        "چین",
        "قبرس",
        "چیت",
        "کلمبیا",
        "کومور",
        "کره شمالی",
        "کره جنوبی",
        "کاستاریکا",
        "ساحل عاج",
        "کرواسی",
        "کوبا",
        "دانمارک",
        "دومینیکا",
        "اکوادور",
        "مصر",
        "السالوادور",
        "امارات متحده عربی",
        "اریتره",
        "استونی",
        "اتیوپی",
        "فیجی",
        "فیلیپین",
        "فنلاند",
        "فرانسه",
        "گابن",
        "گامبیا",
        "جزایر جنوبی جرجیا و ساندویچ جنوبی",
        "گرجستان",
        "آلمان",
        "غنا",
        "جامائیکا",
        "ژاپن",
        "جبل‌الطارق",
        "جیبوتی",
        "اردن",
        "یونان",
        "گرنادا",
        "گرینلند",
        "گوادالوپ",
        "گوام",
        "گواتمالا",
        "گرنزی",
        "گینهٔ استوایی",
        "گینه",
        "گینهٔ بیسائو",
        "گویان فرانسه",
        "گویان",
        "هائیتی",
        "هندوراس",
        "هنگ‌کنگ",
        "هند",
        "اندونزی",
        "ایران",
        "عراق",
        "ایرلند",
        "ایسلند",
        "جزیرهٔ بووه",
        "جزیرهٔ نورفولک",
        "جزیرهٔ من",
        "جزیرهٔ کریسمس",
        "جزایر BES",
        "جزایر کِیمن",
        "جزایر کوکوس (کیلینگ)",
        "جزایر کوک",
        "جزایر فالکلند",
        "جزایر هرد و مک‌دونالد",
        "جزایر ماریانای شمالی",
        "جزایر مارشال",
        "جزایر پیت‌کرن",
        "جزایر سلیمان",
        "جزایر ویرجین آمریکا",
        "جزایر ویرجین بریتانیا",
        "جزایر کوچک خارجی ایالات متحده",
        "اسرائیل",
        "ایتالیا",
        "جرزی",
        "قزاقستان",
        "کنیا",
        "قرقیزستان",
        "کیریباتی",
        "کویت",
        "لائوس",
        "لسوتو",
        "لتونی",
        "لبنان",
        "لیبریا",
        "لیبی",
        "لیختنشتاین",
        "لیتوانی",
        "لوکزامبورگ",
        "ماکائو",
        "مقدونیه",
        "ماداگاسکار",
        "مالاوی",
        "مالدیو",
        "مالزی",
        "مالی",
        "مالتا",
        "مراکش",
        "مارتینیک",
        "موریتانی",
        "موریس",
        "مایوت",
        "مکزیک",
        "میکرونزی",
        "مولداوی",
        "موناکو",
        "مغولستان",
        "مونته‌نگرو",
        "مونتسرات",
        "موزامبیک",
        "نامیبیا",
        "نائورو",
        "نپال",
        "نیکاراگوئه",
        "نیجر",
        "نیجریه",
        "نیوئه",
        "نروژ",
        "کالدونیای نو",
        "نیوزیلند",
        "عمان",
        "هلند",
        "پاکستان",
        "پالائو",
        "فلسطین",
        "پاناما",
        "پاپوا گینه نو",
        "پاراگوئه",
        "پرو",
        "پلی‌نزی فرانسه",
        "لهستان",
        "پورتوریکو",
        "پرتغال",
        "قطر",
        "جمهوری دموکراتیک کنگو",
        "انگلستان",
        "جمهوری چک",
        "جمهوری افریقای مرکزی",
        "جمهوری دومینیکن",
        "جمهوری کنگو",
        "ریونیون",
        "رومانی",
        "رواندا",
        "روسیه",
        "صحرای غربی",
        "سنت کیتس و نویس",
        "سنت وینسنت و گرنادین‌ها",
        "سنت بارت",
        "سنت مارتین",
        "سنت پیر و میکلون",
        "ساموآی آمریکا",
        "ساموآ",
        "سان مارینو",
        "سنت هلنا، اسنسین و ترستان دا کونیا",
        "سنت لوسیا",
        "سنگال",
        "صربستان",
        "سیشل",
        "سیرالئون",
        "سنگاپور",
        "سینت مارتن",
        "سوریه",
        "اسلواکی",
        "اسلوونی",
        "سومالی",
        "اسپانیا",
        "سریلانکا",
        "ایالات متحده آمریکا",
        "آفریقای جنوبی",
        "سودان جنوبی",
        "سودان",
        "سورینام",
        "اسوالبارد و جان ماین",
        "سوئد",
        "سوئیس",
        "اسوازیلند",
        "تاجیکستان",
        "تایوان",
        "تانزانیا",
        "سرزمین‌های جنوب و قطب جنوب فرانسه",
        "سرزمین بریتانیایی اقیانوس هند",
        "تایلند",
        "تیمور شرقی",
        "توگو",
        "توکلائو",
        "تونگا",
        "ترینیداد و توباگو",
        "تونس",
        "ترکیه",
        "ترکمنستان",
        "جزایر تورکس و کایکوس",
        "تووالو",
        "اوکراین",
        "اوگاندا",
        "مجارستان",
        "اروگوئه",
        "ازبکستان",
        "وانواتو",
        "ونزوئلا",
        "ویتنام",
        "والیس و فوتونا",
        "یمن",
        "زامبیا",
        "زیمبابوه",
    ];

    const ADDRESS_SECONDARY_ADDR_TYPE: &'static [&'static str] = &["آپارتمان", "طبقه", "واحد"];

    const ADDRESS_STATE: &'static [&'static str] = &[
        "آذربایجان شرقی",
        "آذربایجان غربی",
        "اردبیل",
        "اصفهان",
        "البرز",
        "ایلام",
        "بوشهر",
        "تهران",
        "چهارمحال و بختیاری",
        "خراسان جنوبی",
        "خراسان رضوی",
        "خراسان شمالی",
        "خوزستان",
        "زنجان",
        "سمنان",
        "سیستان و بلوچستان",
        "فارس",
        "قزوین",
        "قم",
        "کردستان",
        "کرمان",
        "کرمانشاه",
        "کهگیلویه و بویراحمد",
        "گلستان",
        "گیلان",
        "لرستان",
        "مازندران",
        "مرکزی",
        "هرمزگان",
        "همدان",
        "یزد",
    ];

    // استان‌های ایران (به فارسی) و مخفف‌های دو حرفی آن‌ها
    const ADDRESS_STATE_ABBR: &'static [&'static str] = &[
        "آذش",   // آذربایجان شرقی
        "آذغ",   // آذربایجان غربی
        "ارد",   // اردبیل
        "اصف",   // اصفهان
        "البر",  // البرز
        "ایلا",   // ایلام
        "بوش",   // بوشهر
        "تهر",   // تهران
        "چهار",  // چهارمحال و بختیاری
        "خراج",  // خراسان جنوبی
        "خرار",  // خراسان رضوی
        "خراس",  // خراسان شمالی
        "خوز",   // خوزستان
        "زنج",   // زنجان
        "سمن",   // سمنان
        "سیست",  // سیستان و بلوچستان
        "فارس",  // فارس
        "قزو",   // قزوین
        "قم",    // قم
        "کرد",   // کردستان
        "کرمان", // کرمان
        "کرما",  // کرمانشاه
        "کهگی",  // کهگیلویه و بویراحمد
        "گلست",  // گلستان
        "گیلا",   // گیلان
        "لرست",  // لرستان
        "مازن",  // مازندران
        "مرک",   // مرکزی
        "هرمز",  // هرمزگان
        "همد",   // همدان
        "یزد",   // یزد
    ];

    const ADDRESS_STREET_SUFFIX: &'static [&'static str] =
        &["جاده", "بلوار", "خیابان", "کوچه", "میدان"];
    const ADDRESS_STREET_TPL: &'static str = "{StreetSuffix} {StreetName}";
    const ADDRESS_TIME_ZONE: &'static [&'static str] = &["Asia/Tehran"];
    const ADDRESS_ZIP_FORMATS: &'static [&'static str] = &["#####-#####"];
    const ADDRESS_POSTCODE_FORMATS: &'static [&'static str] = &["#####-#####"];

    const CURRENCY_NAME: &'static [&'static str] = &[
        "درهم امارات متحده عربی",
        "افغانی",
        "لیک آلبانی",
        "درام ارمنی",
        "فریال آنتیل هلند",
        "کوانزا آنگولایی",
        "پزو آرژانتین",
        "دلار استرالیا",
        "فریال آروبی",
        "منات آذربایجان",
        "مارک بوسنی",
        "دلار باربادوس",
        "تاکای بنگلادش",
        "لف بلغاری جدید",
        "دینار بحرین",
        "فرانک بوروندی",
        "دلار برمودا",
        "دلار برونئی",
        "موردول بولیوی",
        "ریال برزیل",
        "دلار باهاما",
        "نولت‌روم بوتان",
        "پولای بوتسوانا",
        "روبل بلاروس",
        "دلار بلیز",
        "دلار کانادا",
        "فرانک کنگو",
        "فرانک سوئیس",
        "پزو شیلی",
        "یوان چین",
        "پزو کلمبیا",
        "کولون کاستاریکا",
        "پزو کوبا",
        "اسکود کاپ‌ورد",
        "کرون چک",
        "فرانک گبیوتی",
        "کرون دانمارک",
        "پزو دومینیکن",
        "دینار الجزایر",
        "پوند مصر",
        "نکفا اریتره",
        "بیری اتیوپی",
        "یورو",
        "دلار فیجی",
        "پوند فالکلند",
        "پوند بریتانیا",
        "لار گرجستان",
        "سدی غنا",
        "پوند جبل‌الطارق",
        "دالاسی گامبیا",
        "فرانک گینه",
        "کتزال گواتمالا",
        "دلار گویان",
        "دلار هنگ‌کنگ",
        "لمپیرای هندوراس",
        "گورد هائیتی",
        "فریال مجارستان",
        "روپیه اندونزی",
        "شکل جدید اسرائیل",
        "روپیه هند",
        "دینار عراق",
        "ریال ایران",
        "کرون ایسلند",
        "دلار جامائیکا",
        "دینار اردن",
        "ین ژاپن",
        "شلینگ کنیا",
        "سوم قرقیزستان",
        "ریل کامبوج",
        "فرانک کومور",
        "ون شمالی کره",
        "ون جنوبی کره",
        "دینار کویت",
        "دلار کِیمن",
        "تنجه قزاقستان",
        "کیپ لائوس",
        "لیره لبنان",
        "روپیه سریلانکا",
        "دلار لیبریا",
        "لوتی لسوتو",
        "دینار لیبی",
        "درهم مراکش",
        "لئوی مولداوی",
        "اریاری مالاگاسی",
        "دینار مقدونیه",
        "کیات برمه",
        "توگریک مغولستان",
        "پاتاکای ماکائو",
        "اوگیویای موریتانی",
        "روپیه موریس",
        "روفیای مالدیو",
        "کواچا مالاوی",
        "پزو مکزیک",
        "رینگیت مالزی",
        "متیکال موزامبیک",
        "دلار نامیبیا",
        "نایرا نیجریه",
        "کوردوبای نیکاراگوئه",
        "کرون نروژ",
        "روپیه نپال",
        "دلار نیوزیلند",
        "ریال عمان",
        "بالبوای پاناما",
        "سول نوئو پرو",
        "کینا پاپوا گینه نو",
        "پزو فیلیپین",
        "روپیه پاکستان",
        "زلوتی لهستان",
        "گوارانی پاراگوئه",
        "ریال قطر",
        "لئوی رومانی جدید",
        "دینار صربستان",
        "روبل روسیه",
        "فرانک رواندا",
        "ریال سعودی",
        "دلار سلیمان",
        "روپیه سیشل",
        "پوند سودان",
        "کرون سوئد",
        "دلار سنگاپور",
        "پوند سنت هلن",
        "لئون سیرالئون",
        "شلینگ سومالی",
        "دلار سورینام",
        "پوند سودان جنوبی",
        "دوبرا سائوتومه و پرینسیپ",
        "لیره سوریه",
        "لیلانگنی اسواتینی",
        "بات تایلند",
        "سومونی تاجیکستان",
        "مانات ترکمنستان",
        "دینار تونس",
        "پائانگا تونگا",
        "لیره ترکیه جدید",
        "دلار ترینیداد و توباگو",
        "دلار جدید تایوان",
        "شلینگ تانزانیا",
        "گریون ناحیهٔ اوکراین",
        "شلینگ اوگاندا",
        "دلار ایالات متحده",
        "پزو اروگوئه",
        "سوم ازبکستان",
        "بولیوار ونزوئلا",
        "دونگ ویتنام",
        "واتو",
        "تالا ساموآ",
        "دلار کارائیب شرقی",
        "ریال یمن",
        "راند آفریقای جنوبی",
        "کواچا زامبیا",
        "دلار زیمبابوه",
    ];

    const CURRENCY_CODE: &'static [&'static str] = &[
        "AED", "AFN", "ALL", "AMD", "ANG", "AOA", "ARS", "AUD", "AWG", "AZN", "BAM", "BBD", "BDT",
        "BGN", "BHD", "BIF", "BMD", "BND", "BOV", "BRL", "BSD", "BTN", "BWP", "BYN", "BZD", "CAD",
        "CDF", "CHF", "CLP", "CNY", "COP", "CRC", "CUP", "CVE", "CZK", "DJF", "DKK", "DOP", "DZD",
        "EGP", "ERN", "ETB", "EUR", "FJD", "FKP", "GBP", "GEL", "GHS", "GIP", "GMD", "GNF", "GTQ",
        "GYD", "HKD", "HNL", "HTG", "HUF", "IDR", "ILS", "INR", "IQD", "IRR", "ISK", "JMD", "JOD",
        "JPY", "KES", "KGS", "KHR", "KMF", "KPW", "KRW", "KWD", "KYD", "KZT", "LAK", "LBP", "LKR",
        "LRD", "LSL", "LYD", "MAD", "MDL", "MGA", "MKD", "MMK", "MNT", "MOP", "MRO", "MUR", "MVR",
        "MWK", "MXN", "MYR", "MZN", "NAD", "NGN", "NIO", "NOK", "NPR", "NZD", "OMR", "PAB", "PEN",
        "PGK", "PHP", "PKR", "PLN", "PYG", "QAR", "RON", "RSD", "RUB", "RWF", "SAR", "SBD", "SCR",
        "SDG", "SEK", "SGD", "SHP", "SLL", "SOS", "SRD", "SSP", "STD", "SYP", "SZL", "THB", "TJS",
        "TMT", "TND", "TOP", "TRY", "TTD", "TWD", "TZS", "UAH", "UGX", "USD", "UYU", "UZS", "VEF",
        "VND", "VUV", "WST", "XCD", "YER", "ZAR", "ZMW", "ZWL",
    ];

    const CURRENCY_SYMBOL: &'static [&'static str] = &[
        "HK$", "Ft", "₪", "¥", "$", "kr", "PhP", "zł", "CHF", "NT$", "฿", "£", "¢", "Rp", "ƒ", "€",
        "रू", "﷼",
    ];

    // Add company related constants
    const COMPANY_SUFFIX: &'static [&'static str] =
        &["سهامی‌عام", "سهامی‌خاص", "با مسئولیت محدود", "تعاونی"];

    const NAME_TITLE: &'static [&'static str] = &[
        "آقای",
        "خانم",
        "دکتر",
        "استاد",
        "پروفسور",
        "دوشیزه",
        "بانو",
        "مهندس",
    ];
    const NAME_TPL: &'static str = "{FirstName} {LastName}";
    const NAME_WITH_TITLE_TPL: &'static str = "{Title} {FirstName} {LastName}";

    const JOB_SENIORITY: &'static [&'static str] = &["ارشد", "کارمند", "رئیس"];

    const JOB_FIELD: &'static [&'static str] = &[
        "آشپز",
        "آهنگر",
        "آرایشگر",
        "طراح",
        "کارگردان",
        "مبل‌ساز",
        "مکانیک",
        "پزشک",
        "پاکبان",
        "برنامه‌نویس",
        "خیاط",
        "بازیاب",
        "صندوق‌دار",
        "نگهبان",
        "نجار",
        "کارگر",
        "کارمند",
        "منشی",
        "کفاش",
        "بنا",
        "معمار",
        "پلیس",
        "قاضی",
    ];

    const JOB_POSITION: &'static [&'static str] = &[
        "سرپرست",
        "هماهنگ‌کننده",
        "مهندس",
        "متخصص",
        "تکنسین",
        "مدیر",
        "مدیر اجرایی",
        "تحلیل‌گر",
        "طراح",
        "مشاور",
        "تهیه‌کننده",
        "دستیار",
        "نماینده",
        "سرکارگر",
        "فرمانده",
    ];

    const JOB_TITLE_TPL: &'static str = "{Position} {Seniority} {Field}";

    const ADDRESS_CITY_TPL: &'static str = "{CityName} {CitySuffix}";
    const ADDRESS_CITY_WITH_PREFIX_TPL: &'static str = "{CityPrefix} {CityName} {CitySuffix}";
    const ADDRESS_SECONDARY_ADDR_TPL: &'static str = "{SecondaryAddrType} {Number}";

    const COMPANY_NAME_TPLS: &'static [&'static str] =
        &["{Name_1} {Suffix}", "{Name_1} e {Name_2} {Suffix}"];
    const COMPANY_BUZZWORD_HEAD: &'static [&'static str] = &[
        "بنیادی",
        "پیشرفته",
        "انطباق پذیر",
        "مجازی",
        "پیشرو",
        "سازمان‌‌یافته",
        "یک‌پارچه",
        "نوآورانه",
    ];

    const COMPANY_BUZZWORD_MIDDLE: &'static [&'static str] = &[
        "۲۴ ساعته",
        "جهانی",
        "پویا",
        "تجاری",
        "فعال",
        "پایدار",
        "هوشمند",
    ];

    const COMPANY_BUZZWORD_TAIL: &'static [&'static str] = &["خدمات", "زیرساخت", "چشم‌انداز"];

    const COMPANY_CATCH_PHASE_TPL: &'static str = "{Head} {Middle} {Tail}";

    const COMPANY_BS_VERBS: &'static [&'static str] = &[
        "پیاده‌سازی",
        "تکامل",
        "تقویت",
        "گسترش",
        "نوآوری",
        "ادغام",
        "بهره‌وری",
        "بهینه‌سازی",
    ];

    const COMPANY_BS_ADJ: &'static [&'static str] = &[
        "کارآمد",
        "فعال",
        "مقیاس‌پذیر",
        "استراتژیک",
        "یکپارچه",
        "دیجیتال",
        "پویا",
    ];

    const COMPANY_BS_NOUNS: &'static [&'static str] =
        &["فناوری‌ها", "روش‌ها", "ابتکارات", "زیرساخت‌ها", "پلتفرم‌ها"];

    const COMPANY_BS_TPL: &'static str = "{Verb} {Noun} {Adj}";
}

impl CityNameGenFn for FA_IR {}

const LICENSE_PLATE_FA_IR: &[&str] = &["## ABC ###", "## AB ####"];

impl Dummy<LicencePlate<FA_IR>> for String {
    fn dummy_with_rng<R: rand::RngExt + ?Sized>(_: &LicencePlate<FA_IR>, rng: &mut R) -> Self {
        let fmt = LICENSE_PLATE_FA_IR.choose(rng).unwrap();
        crate::faker::impls::automotive::numerify_licence_plate(fmt, rng)
    }
}
